{
  "_name_or_path": "DeepDream-MLX-Models",
  "architectures": [
    "GoogleNet",
    "VGG16",
    "VGG19"
  ],
  "model_type": "feature-extractor",
  "framework": "mlx",
  "task_specific_params": {
    "deepdream": {
      "description": "Models converted for DeepDream applications on Apple Silicon using MLX.",
      "input_image_size": [224, 224],
      "num_channels": 3,
      "image_channel_order": "HWC",
      "image_mean": [0.485, 0.456, 0.406],
      "image_std": [0.229, 0.224, 0.225]
    }
  },
  "license": "apache-2.0",
  "tags": [
    "deepdream",
    "mlx",
    "computer-vision",
    "googlenet",
    "vgg16",
    "vgg19",
    "feature-extraction"
  ]
}
